In [792]:
import pandas as pd

In [793]:
%cd ../datasets/

c:\Personal Files\Arya\Programs\FloatChat\datasets

In [794]:
year=input('Enter the year(2001-2017): ')

In [795]:
#Cleaning the dataset 2002
df=pd.read_csv(f'ARGO_DB_{year}.csv')

In [796]:
df

,ad_observation_id,depth,depth_flag,temperature,temperature_flag,salinity,salinity_flag,density,density_flag,EEZ_flag
0,1900816_06/01/2017,4.6,1,28.856,1,35.298,1,1022.338013,1,NaN
1,1900816_06/01/2017,10.4,1,28.558,1,35.343,1,1022.471008,1,NaN
2,1900816_06/01/2017,17.7,1,27.923,1,35.369,1,1022.700012,1,NaN
3,1900816_06/01/2017,24.6,1,27.439,1,35.338,1,1022.833008,1,NaN
4,1900816_06/01/2017,31.3,1,27.042,1,35.282,1,1022.919006,1,NaN
...,...,...,...,...,...,...,...,...,...,...
5647092,5902487_08/01/2017,622.0,1,7.716,1,34.539,1,1026.953979,1,NaN
5647093,5902487_08/01/2017,624.0,1,7.712,1,34.538,1,1026.953979,1,NaN
5647094,5902487_08/01/2017,626.0,1,7.639,1,34.534,1,1026.961060,1,NaN
5647095,5902487_08/01/2017,628.0,1,7.584,1,34.528,1,1026.964966,1,NaN
5647096,5902487_08/01/2017,630.0,1,7.556,1,34.526,1,1026.967041,1,NaN

In [797]:
df.info() #Info about the dataset

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5647097 entries, 0 to 5647096
Data columns (total 10 columns):
 #   Column             Dtype
---  ------             -----
 0   ad_observation_id  object
 1   depth              float64
 2   depth_flag         int64
 3   temperature        float64
 4   temperature_flag   int64
 5   salinity           float64
 6   salinity_flag      int64
 7   density            float64
 8   density_flag       int64
 9   EEZ_flag           float64
dtypes: float64(5), int64(4), object(1)
memory usage: 430.8+ MB

In [798]:
df.isnull().sum() ##No null values - checked

ad_observation_id          0
depth                      0
depth_flag                 0
temperature                0
temperature_flag           0
salinity                   0
salinity_flag              0
density                    0
density_flag               0
EEZ_flag             5647097
dtype: int64

In [799]:
# Set threshold (e.g., drop if more than 90% values are null)
threshold = 0.3

# Calculate null ratio per column
null_ratio = df.isna().sum() / len(df)

# Columns where null ratio exceeds threshold
cols_to_drop = null_ratio[null_ratio > threshold].index.tolist()

# Drop those columns
df.drop(columns=cols_to_drop, inplace=True)

# For the remaining columns, drop null rows and reset index
df.dropna(axis=0, inplace=True)
df.reset_index(drop=True, inplace=True)

In [800]:
df.columns #Checking if there's extra whitespace in columns

Index(['ad_observation_id', 'depth', 'depth_flag', 'temperature',
       'temperature_flag', 'salinity', 'salinity_flag', 'density',
       'density_flag'],
      dtype='object')

In [801]:
#Trim if extra whitespace
df.columns = df.columns.str.strip()

In [802]:
#splitting ad_observation_id into separate attributes float_id and observation_date
df[["wmo_id", "observation_date"]] = df["ad_observation_id"].str.split("_", expand=True)

# Convert float_id to integer
df["wmo_id"] = df["wmo_id"].astype(int)

# Convert observation_date to proper datetime format (YYYY-MM-DD)
df["observation_date"] = pd.to_datetime(df["observation_date"], format="%d/%m/%Y")

#Dropping ad_observation_id
df.drop('ad_observation_id',axis=1,inplace=True)

In [803]:
#seeing new info

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5647097 entries, 0 to 5647096
Data columns (total 10 columns):
 #   Column            Dtype
---  ------            -----
 0   depth             float64
 1   depth_flag        int64
 2   temperature       float64
 3   temperature_flag  int64
 4   salinity          float64
 5   salinity_flag     int64
 6   density           float64
 7   density_flag      int64
 8   wmo_id            int64
 9   observation_date  datetime64[ns]
dtypes: datetime64[ns](1), float64(4), int64(5)
memory usage: 430.8 MB

In [804]:
df.head()

,depth,depth_flag,temperature,temperature_flag,salinity,salinity_flag,density,density_flag,wmo_id,observation_date
0,4.6,1,28.856,1,35.298,1,1022.338013,1,1900816,2017-01-06
1,10.4,1,28.558,1,35.343,1,1022.471008,1,1900816,2017-01-06
2,17.7,1,27.923,1,35.369,1,1022.700012,1,1900816,2017-01-06
3,24.6,1,27.439,1,35.338,1,1022.833008,1,1900816,2017-01-06
4,31.3,1,27.042,1,35.282,1,1022.919006,1,1900816,2017-01-06

In [805]:
df['depth_flag'].value_counts()

depth_flag
1    5587336
2      40027
4      19734
Name: count, dtype: int64

In [806]:
df['temperature_flag'].value_counts()

temperature_flag
1    5582103
2      40027
4      23812
3       1155
Name: count, dtype: int64

In [807]:
df['salinity_flag'].value_counts()

salinity_flag
1    5441267
4     126478
3      79352
Name: count, dtype: int64

In [808]:
df['density_flag'].value_counts()

density_flag
1    5440975
4     126770
2      40027
3      39325
Name: count, dtype: int64

In [809]:
#Checking for duplicate tuples
df.duplicated().value_counts()

False    3955466
True     1691631
Name: count, dtype: int64

In [810]:
df[df.duplicated(keep=False)] #Seeing the duplicated rows

,depth,depth_flag,temperature,temperature_flag,salinity,salinity_flag,density,density_flag,wmo_id,observation_date
0,4.6,1,28.856,1,35.298,1,1022.338013,1,1900816,2017-01-06
1,10.4,1,28.558,1,35.343,1,1022.471008,1,1900816,2017-01-06
2,17.7,1,27.923,1,35.369,1,1022.700012,1,1900816,2017-01-06
3,24.6,1,27.439,1,35.338,1,1022.833008,1,1900816,2017-01-06
4,31.3,1,27.042,1,35.282,1,1022.919006,1,1900816,2017-01-06
...,...,...,...,...,...,...,...,...,...,...
5647092,622.0,1,7.716,1,34.539,1,1026.953979,1,5902487,2017-01-08
5647093,624.0,1,7.712,1,34.538,1,1026.953979,1,5902487,2017-01-08
5647094,626.0,1,7.639,1,34.534,1,1026.961060,1,5902487,2017-01-08
5647095,628.0,1,7.584,1,34.528,1,1026.964966,1,5902487,2017-01-08
5647096,630.0,1,7.556,1,34.526,1,1026.967041,1,5902487,2017-01-08

In [811]:
# Drop duplicate rows
df = df.drop_duplicates()

# Reset the index so it’s clean and sequential
df = df.reset_index(drop=True)

In [812]:
#Final Verification
df.duplicated().value_counts()

False    3955466
Name: count, dtype: int64

In [813]:
flag_cols = ["depth_flag", "temperature_flag", "salinity_flag", "density_flag"]

# Keep only rows where all flag values are between 0 and 9
df = df[(df[flag_cols].ge(0) & df[flag_cols].le(9)).all(axis=1)].reset_index(drop=True)

In [814]:
df['depth_flag'].value_counts()

depth_flag
1    3906488
2      39105
4       9873
Name: count, dtype: int64

In [815]:
df['temperature_flag'].value_counts()

temperature_flag
1    3903524
2      39105
4      12196
3        641
Name: count, dtype: int64

In [816]:
df['salinity_flag'].value_counts()

salinity_flag
1    3824375
3      66396
4      64695
Name: count, dtype: int64

In [817]:
df['density_flag'].value_counts()

density_flag
1    3824140
4      64930
2      39105
3      27291
Name: count, dtype: int64

In [818]:
df.to_csv(f'cleaned/ARGO_DB_{year}_cleaned.csv',index=False)
print(year)

2017